Autodesk.Revit.UI.Events.FormulaEditingEventArgs.Apply(System.String)
Applies formula to the parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.Events.FormulaEditingEventArgs.Formula
Returns text of the formula that will be modified

Autodesk.Revit.UI.Events.FormulaEditingEventArgs.ParameterId
Returns the Id of the modified parameter

Autodesk.Revit.UI.Events.FormulaEditingEventArgs.CurrentDocument
Returns the current document

Autodesk.Revit.UI.Events.FormulaEditingEventArgs
The event arguments used by the DocumentSaving event.